src/test/resources/example/chargeNeed.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://cnr-seas.cloudapp.net/scp/ISmartCharging/GetChargingPlans</Action>
  </s:Header>
  <s:Body>
    <GetChargingPlans xmlns="http://cnr-seas.cloudapp.net/scp/">
      <value xmlns:d4p1="http://schemas.datacontract.org/2004/07/SIGE.WCF" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <d4p1:ChargeNeeds>
          <d4p1:ChargeNeed>
            <d4p1:DateReprise>2016-03-04T07:02:43.9480264Z</d4p1:DateReprise>
            <d4p1:Energie>20</d4p1:Energie>
            <d4p1:IdCharge>1</d4p1:IdCharge>
            <d4p1:MargeDuree>0</d4p1:MargeDuree>
            <d4p1:MargeEnergie>0</d4p1:MargeEnergie>
            <d4p1:PMax>4</d4p1:PMax>
            <d4p1:PMin>3</d4p1:PMin>
            <d4p1:Priorite>0</d4p1:Priorite>
            <d4p1:TypeCharge>Planifiee</d4p1:TypeCharge>
          </d4p1:ChargeNeed>
        </d4p1:ChargeNeeds>
        <d4p1:OptimisationPmaxSite>40</d4p1:OptimisationPmaxSite>
      </value>
    </GetChargingPlans>
  </s:Body>
</s:Envelope>